Repository: chenyynx/Agents-Anywhere
Catalog: ios/Agents Anywhere/Agents Anywhere/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# dashboard.device.runtimeConfigFields.codexHome.description
source: Stores configuration, sign-in data, and session history for this Codex instance. Running Codex instances cannot use the same directory.
zh_hans: 保存此 Codex 实例的配置、登录信息和会话历史。正在运行的 Codex 实例不能使用同一个目录。

# dashboard.device.runtimeConfigFields.codexHome.label
source: Codex data directory
zh_hans: Codex 数据目录

# dashboard.device.runtimeConfigFields.modelGatewayApiKey.description
source: The API key sent to this gateway. It is stored and returned as part of the runtime configuration.
zh_hans: 发送给这个 Gateway 的 API Key。它会作为 Runtime 配置的一部分被存储并返回。

# dashboard.device.runtimeConfigFields.modelGatewayBaseUrl.description
source: The HTTP or HTTPS base URL exposed by your model gateway.
zh_hans: 模型 Gateway 对外提供的 HTTP 或 HTTPS 基础地址。

# dashboard.device.runtimeConfigFields.modelGatewayBaseUrl.label
source: Gateway URL
zh_hans: Gateway 地址

# dashboard.device.runtimeConfigFields.useSystemCodex.description
source: Use the Codex executable from your login shell PATH. If it is unavailable, the bundled Codex is used automatically. Turn this off to always use the bundled Codex.
zh_hans: 优先使用登录 Shell PATH 中的 Codex；如果找不到，则自动使用捆绑的 Codex。关闭后将始终只使用捆绑的 Codex。

# dashboard.device.runtimeConfigFields.useSystemCodex.label
source: Use System Codex
zh_hans: 使用系统 Codex

# dashboard.device.runtimeNamePlaceholder
source: Runtime instance name
zh_hans: Runtime 实例名称

# dashboard.device.runtimeNotStarted
source: Not started
zh_hans: 未启动

# dashboard.device.runtimeStatus.available
source: Available
zh_hans: 可用

# dashboard.device.runtimeStatus.discovering
source: Discovering
zh_hans: 正在发现

# dashboard.device.runtimeStatus.error
source: Error
zh_hans: 错误

# dashboard.device.runtimeStatus.running
source: Running
zh_hans: 运行中

# dashboard.device.runtimeStatus.starting
source: Starting
zh_hans: 启动中

# dashboard.device.runtimeStatus.stopped
source: Stopped
zh_hans: 已停止

# dashboard.device.runtimeStatus.stopping
source: Stopping
zh_hans: 停止中

# dashboard.device.runtimeStatus.unavailable
source: Unavailable
zh_hans: 不可用

# dashboard.device.runtimeStatus.unknown
source: Unknown
zh_hans: 未知

# dashboard.device.runtimeStatus.validating
source: Validating
zh_hans: 正在验证

# dashboard.device.showModelGatewayApiKey
source: Show gateway API key
zh_hans: 显示 Gateway API Key

# dashboard.device.unarchiveSelected
source: Unarchive selected
zh_hans: 取消归档已选择

# dashboard.new.modelAndReasoning
source: Model and reasoning
zh_hans: 模型和推理强度

# dashboard.new.permissionModes.autoReview.description
source: Only ask for approval when Codex detects a risky operation.
zh_hans: 仅对检测到的风险操作请求批准

# dashboard.new.permissionModes.claude.acceptEdits.description
source: Automatically accept file edits; still ask for other risky tools.
zh_hans: 自动接受文件编辑；其他高风险工具仍会询问。

# dashboard.new.permissionModes.claude.acceptEdits.label
source: Accept edits
zh_hans: 接受编辑

# dashboard.new.permissionModes.claude.auto.description
source: Use Claude Code's automatic classifier for risky actions.
zh_hans: 使用 Claude Code 的自动分类器判断高风险操作。

# dashboard.new.permissionModes.claude.auto.label
source: Auto mode
zh_hans: 自动模式

# dashboard.new.permissionModes.claude.bypassPermissions.description
source: Skip permission prompts and allow unrestricted tool use.
zh_hans: 跳过权限确认，允许不受限制地使用工具。

# dashboard.new.permissionModes.claude.bypassPermissions.label
source: Bypass permissions
zh_hans: 完全访问权限

# dashboard.new.permissionModes.claude.default.description
source: Use Claude Code's default prompts for risky tools.
zh_hans: 使用 Claude Code 默认的高风险工具确认方式。

# dashboard.new.permissionModes.claude.default.label
source: Ask permissions
zh_hans: 询问权限

# dashboard.new.permissionModes.claude.dontAsk.description
source: Deny unapproved tools instead of asking for permission.
zh_hans: 拒绝未获批准的工具，不再弹出权限确认。

# dashboard.new.permissionModes.claude.dontAsk.label
source: Don't ask
zh_hans: 不询问

# dashboard.new.permissionModes.claude.plan.description
source: Allow planning without executing writes or commands.
zh_hans: 允许规划，但不执行写入或命令。

# dashboard.new.permissionModes.claude.plan.label
source: Plan mode
zh_hans: 计划模式

# dashboard.new.permissionModes.fullAccess.description
source: Allow unrestricted internet access and access to any file on this computer.
zh_hans: 可不受限制地访问互联网和您电脑上的任何文件

# dashboard.new.permissionModes.fullAccess.label
source: Full access
zh_hans: 完全访问权限

# dashboard.new.permissionModes.requestApproval.description
source: Always ask before editing files outside the workspace or using the internet.
zh_hans: 编辑外部文件和使用互联网时始终询问

# dashboard.new.permissionModes.requestApproval.label
source: Request approval
zh_hans: 请求批准

# dashboard.new.typewriter.buildNext
source: What should we build next?
zh_hans: 接下来要构建什么？

# dashboard.new.typewriter.focusedSession
source: Start a focused session.
zh_hans: 开始一个专注会话。

# dashboard.new.typewriter.giveTask
source: Give the agent a task.
zh_hans: 给 Agent 一个任务。

# dashboard.new.typewriter.needsAttention
source: What needs attention?
zh_hans: 哪里需要关注？

# dashboard.new.typewriter.rightDevice
source: Send work to the right device.
zh_hans: 把任务发送到合适的设备。

# dashboard.new.typewriter.startWhere
source: Where should the agent start?
zh_hans: Agent 应该从哪里开始？

# dashboard.new.typewriter.startWorkspace
source: Start from a project.
zh_hans: 从一个项目开始。

# dashboard.new.typewriter.workOn
source: What should we work on?
zh_hans: 我们要处理什么？

# dashboard.pairDevice.codeLabel
source: Pair code from device
zh_hans: 设备上的配对码

# dashboard.pairDevice.codeStepTitle
source: Pair with code
zh_hans: 使用配对码配对

# dashboard.pairDevice.commandStepTitle
source: Connect using a token
zh_hans: 使用 Token 连接

# dashboard.pairDevice.connectionDescription
source: Connect your device using the desktop app or CLI.
zh_hans: 您可以通过桌面程序或 CLI 连接您的设备。

# dashboard.pairDevice.nameDescription
source: Give your device a recognizable name, then choose a pairing method.
zh_hans: 为您的设备起一个容易辨认的名字，然后选择配对方式。

# dashboard.pairDevice.namePlaceholder
source: e.g. amber-finch
zh_hans: 例如 amber-finch

# dashboard.pairDevice.nameTitle
source: Name your device
zh_hans: 命名设备

# dashboard.pairDevice.quickAdd
source: Quick add
zh_hans: 快速添加

# dashboard.pairDevice.tokenDescription
source: Run a command containing a token on your device to connect directly.
zh_hans: 在设备终端运行包含 Token 的命令，直接完成连接。

# dashboard.projects.workspace
source: Path
zh_hans: 路径

# dashboard.session.workspace
source: Workspace
zh_hans: 工作目录

# privacyPolicy.agents.body
source: The server forwards your tasks to the device and agent you select. Depending on their configuration, agents may send messages, attachments and workspace content to model providers or a custom gateway. Those services process information under their own policies.
zh_hans: 服务器会将任务转交给你选中的设备和 Agent。Agent 可能根据配置，将消息、附件及工作目录中的相关内容发送给模型供应商或自定义 Gateway。这些服务按各自的政策处理信息。

# privacyPolicy.agents.title
source: Agents and external services
zh_hans: Agent 与外部服务

# privacyPolicy.contact.body
source: For questions about the client's handling of information, use the project's support channels. For access to, correction or deletion of information held by a server or model service, contact its operator. Policy updates will be reflected in the date above.
zh_hans: 如对客户端的信息处理有疑问，可以通过项目支持渠道联系我们。如需访问、更正或删除服务器、模型服务保存的信息，请联系其运营者。政策更新时会同步修改上方日期。

# privacyPolicy.contact.title
source: Contact and updates
zh_hans: 联系与更新

# privacyPolicy.externalContent.body
source: Displaying remote images or web previews and opening external links may connect to the corresponding website, which can receive connection information such as your IP address.
zh_hans: 显示远程图片、网页预览或打开外部链接时，客户端可能连接相应网站，该网站可以接收到 IP 地址等连接信息。

# privacyPolicy.introduction
source: This policy explains how the Agents Anywhere app for iPhone, iPad and Mac handles information. The server you connect to, connected devices and model services may be operated by different parties and have their own privacy policies.
zh_hans: 本政策说明 Agents Anywhere 的 iPhone、iPad 和 Mac 客户端如何处理信息。你连接的服务器、设备和模型服务可能由不同主体运营，并有各自的隐私政策。

# privacyPolicy.localStorage.body
source: Sign-in tokens are stored in the system Keychain. The app also saves preferences, account details and cached project and session data on this device to restore your workspace and display previously loaded content offline. Previewing files may create temporary downloads.
zh_hans: 登录令牌保存在系统钥匙串中。客户端也会在本设备保存偏好设置、账户资料及已加载的项目和会话数据，用于恢复工作区和离线显示内容。预览文件时可能生成临时下载。

# privacyPolicy.localStorage.title
source: Information on this device
zh_hans: 本设备保存的信息

# privacyPolicy.permissions.body
source: Local network access is used to connect to servers on your local network. Camera access is used to scan login QR codes. You choose photos and files through system pickers. You can manage granted permissions in system settings.
zh_hans: 本地网络权限用于连接局域网中的服务器，相机权限用于扫描登录二维码。照片和文件由你通过系统选择器选取。你可以在系统设置中管理已授予的权限。

# privacyPolicy.permissions.title
source: System permissions
zh_hans: 系统权限

# privacyPolicy.projectSupport
source: Project support
zh_hans: 项目支持

# privacyPolicy.retention.body
source: Signing out removes the app's saved sign-in credentials from this device and clears the current account's local session cache. It does not delete your account or content already stored on servers, connected devices or model services. Retention and deletion of that content depend on the relevant operator or provider; contact them to request deletion.
zh_hans: 退出登录会移除 App 在本设备保存的登录凭据，并清理当前账号的本地会话缓存。这不会删除你的账号，也不会删除已保存在服务器、连接设备或模型服务中的内容。这些内容的保存期限与删除方式由相应运营者或服务商决定；如需删除，请联系他们。

# privacyPolicy.retention.title
source: Retention and deletion
zh_hans: 保存与删除

# privacyPolicy.server.body
source: To sign in and use the service, the app exchanges account details, authorization credentials, device and project information, messages and attachments with the server you choose. Agent settings, including API keys you enter, are also sent to that server to configure your agents. The server receives connection information such as your IP address.
zh_hans: 登录与使用服务时，客户端会与你选择的服务器交换账户资料、登录授权信息、设备和项目数据、消息及附件。你保存的 Agent 配置（可能包含 API Key）也会发送到该服务器，用于配置相应 Agent。服务器还会接收到 IP 地址等连接信息。

# privacyPolicy.server.title
source: Information sent to your server
zh_hans: 发送到服务器的信息

# privacyPolicy.title
source: Privacy policy
zh_hans: 隐私政策

# privacyPolicy.updated
source: Last updated: September 7, 2026
zh_hans: 更新日期：2026 年 9 月 7 日

# runtime.error.claudeProcessRetired
source: The Claude process was terminated after failing to respond. This turn produced no result and any running background tasks have ended. Please try again.
zh_hans: Claude 进程长时间无响应已被终止。本轮未产出，运行中的后台任务已一并结束。请重新发起。

# 上一级目录
source: Parent directory
zh_hans: 上级目录

# 上一项
source: Previous item
zh_hans: 上一项

# 上下文压缩失败
source: Context compaction failed
zh_hans: 上下文压缩失败

# 上下文已压缩
source: Context compacted
zh_hans: 上下文已压缩

# 上次发送的结果尚未确认，正在同步记录。请确认后再重试。
source: The previous send is not confirmed. Syncing messages; check the result before retrying.
zh_hans: 上次发送的结果尚未确认，正在同步记录。请确认后再重试。

# 上次回应未完成，请检查后重新选择。
source: Your previous response did not complete. Review it and choose again.
zh_hans: 上次回应未完成，请检查后重新选择。

# 下一项
source: Next item
zh_hans: 下一项

# 下载
source: Download
zh_hans: 下载

# 下载桌面应用
source: Download from official website
zh_hans: 前往官网下载

# 为命令行设备命名
source: Name your device
zh_hans: 命名设备

# 也可以先在目标设备运行以下命令，再填写 CLI 显示的配对码。
source: You can also run this command on the target device, then enter the pairing code shown by the CLI.
zh_hans: 也可以先在目标设备运行以下命令，再填写 CLI 显示的配对码。

# 交互与通知
source: Interactions and notices
zh_hans: 交互与通知

# 从侧栏添加设备，连接后即可开始。
source: Add a device before choosing a project or starting a session.
zh_hans: 添加设备后才能选择项目或开始会话。

# 从这台设备已配置的实例中选择
source: Choose a configured instance on this device
zh_hans: 从这台设备已配置的实例中选择

# 代码已复制
source: Code copied
zh_hans: 代码已复制

# 任务已中断
source: Task interrupted
zh_hans: 任务已中断

# 会话
source: Sessions
zh_hans: 会话

# 会话已关闭。
source: This session has closed.
zh_hans: 会话已关闭。

# 会话数据不匹配，导出已停止。
source: Session data does not match. Export stopped.
zh_hans: 会话数据不匹配，导出已停止。

# 会话数据暂时无法解析，请刷新状态后回应。已填写的内容会保留。
source: Session data could not be parsed. Refresh the state before responding. Your input is kept.
zh_hans: 会话数据暂时无法解析，请刷新状态后回应。已填写的内容会保留。

# 会话数据格式不兼容
source: Incompatible session data
zh_hans: 会话数据格式不兼容

# 同步已自动恢复
source: Sync recovered automatically
zh_hans: 同步已自动恢复

# 会话数据曾多次同步失败，已重建到最新状态（第 %lld 次自动恢复）。
source: Session data failed to sync repeatedly and was rebuilt to the latest state (automatic recovery %lld).
zh_hans: 会话数据曾多次同步失败，已重建到最新状态（第 %lld 次自动恢复）。

# 会话数据过大，请在 Web 中导出。
source: This session is too large. Export it from Web.
zh_hans: 会话数据过大，请在 Web 中导出。

# 会话文件
source: Files
zh_hans: 文件

# 会话菜单
source: Session options
zh_hans: 会话选项

# 会话详情
source: Session overview
zh_hans: 会话概览

# 会话详情与导出
source: Session details and export
zh_hans: 会话详情与导出

# 你的任务将在所选设备上运行
source: Your task will run on the selected device
zh_hans: 你的任务将在所选设备上运行

# 使用 Token
source: Use a token
zh_hans: 使用 Token

# 使用六位配对码
source: Use a six-digit pairing code
zh_hans: 使用六位配对码

# 使用桌面程序
source: Use the desktop app
zh_hans: 使用桌面程序

# 使用此目录
source: Use this path
zh_hans: 使用此路径

# 使用此项目并保存名称
source: Continue and rename
zh_hans: 继续并重命名

# 使用配对码
source: Use pair code
zh_hans: 使用配对码

# 例如 Agents Anywhere
source: My project
zh_hans: 我的项目

# 侧栏显示
source: Sidebar view
zh_hans: 侧栏显示

# 侧边栏显示会话
source: Show sessions in the sidebar
zh_hans: 侧边栏显示会话

# 保存
source: Save
zh_hans: 保存

# 保留草稿并允许重新创建
source: Keep draft and allow another creation attempt
zh_hans: 保留草稿并允许重新创建

# 修改
source: Modified
zh_hans: 修改

# 停止子代理
source: Stop subagent
zh_hans: 停止子代理

# 子代理运行中
source: Subagent running
zh_hans: 子代理运行中

# 停止生成
source: Interrupt
zh_hans: 中断

# 停止等待
source: Stop waiting
zh_hans: 停止等待

# 先在目标设备运行以下命令，再填写 CLI 显示的配对码。
source: Run the command, then enter the 6-digit pairing code shown in the terminal below.
zh_hans: 运行命令后，将终端显示的 6 位配对码输入下方。

# 全部会话
source: All sessions
zh_hans: 全部会话

# 关闭侧栏
source: Close sidebar
zh_hans: 关闭侧栏

# 关闭后会话回到只读模式。
source: The session will become read-only.
zh_hans: 关闭后会话回到只读模式。

# 关闭后会话回到只读模式。这里产生的记录可能需要重启 Agent 客户端才能同步。
source: The session will become read-only. Restarting the Agent client may be needed to sync messages created here.
zh_hans: 关闭后会话回到只读模式。这里产生的记录可能需要重启 Agent 客户端才能同步。

# 关闭接管
source: Disable Takeover
zh_hans: 关闭接管

# 关闭接管？
source: Disable Takeover?
zh_hans: 关闭接管？

# 关闭此提示
source: Dismiss this notice
zh_hans: 关闭此提示

# 其他回答
source: Other
zh_hans: 其他

# 其他打开方式…
source: Open with…
zh_hans: 其他打开方式…

# 分享原图
source: Share original
zh_hans: 分享原图

# 分享回复
source: Share
zh_hans: 分享

# 分享当前图片
source: Share current image
zh_hans: 分享当前图片

# 列表刚刚更新，请重新加载这一页。
source: The list just changed. Reload this page.
zh_hans: 列表刚刚更新，请重新加载这一页。

# 列表选项
source: List options
zh_hans: 列表选项

# 创建 Agent
source: Spawn Agent
zh_hans: 创建 Agent

# 创建一个项目，开始新的任务。
source: No projects yet.
zh_hans: 还没有项目。

# 创建结果仍未确认，再次创建可能产生重复会话。
source: Creation is still unconfirmed. Trying again may create a duplicate session.
zh_hans: 创建结果仍未确认，再次创建可能产生重复会话。

# 创建结果尚未确认。请先检查会话列表，避免重复创建。草稿已保留。 %@
source: Creation is not confirmed. Check the session list before creating again to avoid duplicates. Your draft is kept. %@
zh_hans: 创建结果尚未确认。请先检查会话列表，避免重复创建。草稿已保留。 %@

# 创建项目
source: Create project
zh_hans: 创建项目

# 删除
source: Delete
zh_hans: 删除

# 删除这个 Agent 的配置？
source: Delete runtime configuration?
zh_hans: 删除 Runtime 配置？

# 删除配置
source: Delete configuration
zh_hans: 删除配置

# 删除项目
source: Delete project
zh_hans: 删除项目

# 删除项目？
source: Delete project?
zh_hans: 删除项目？

# 到底部
source: Bottom
zh_hans: 到底部

# 刷新接管状态
source: Refresh takeover state
zh_hans: 刷新接管状态

# 刷新状态
source: Refresh
zh_hans: 刷新

# 加载会话…
source: Loading sessions...
zh_hans: 加载会话中...

# 加载对话选项…
source: Loading...
zh_hans: 加载中...

# 加载更多会话
source: Load more
zh_hans: 加载更多

# 加载更多归档会话
source: Load more
zh_hans: 加载更多

# 加载较早的消息
source: Load earlier messages
zh_hans: 加载更早消息

# 加载预览…
source: Loading...
zh_hans: 加载中...

# 单个附件请控制在 25 MiB 以内。
source: Each attachment must be no larger than 25 MiB.
zh_hans: 单个附件请控制在 25 MiB 以内。

# 原来选择的项目已不可用，请重新选择。草稿已保留。
source: The previously selected project is unavailable. Choose another project. Your draft is kept.
zh_hans: 原来选择的项目已不可用，请重新选择。草稿已保留。

# 发送
source: Send task
zh_hans: 发送任务

# 发送消息
source: Send
zh_hans: 发送

# 发送结果尚未确认，草稿已保留。请先检查会话是否已收到消息；移除记录后再次发送可能产生重复消息。
source: Sending is not confirmed. Your draft is kept. Check whether the session received the message first; sending again after removing this record may create a duplicate.
zh_hans: 发送结果尚未确认，草稿已保留。请先检查会话是否已收到消息；移除记录后再次发送可能产生重复消息。

# 取消
source: Cancel
zh_hans: 取消

# 取消本轮
source: Cancel turn
zh_hans: 取消本轮

# 取消置顶
source: Unpin
zh_hans: 取消置顶

# 变更
source: Changed
zh_hans: 变更

# 只有没有会话的项目可以删除，设备上的文件会保留。
source: Only projects without sessions can be deleted. Files on the device are kept.
zh_hans: 只有没有会话的项目可以删除，设备上的文件会保留。

# 只读
source: Read only
zh_hans: 只读

# 只读模式，开启接管后可以继续发送消息。
source: Read-only. Enable takeover to continue sending messages.
zh_hans: 只读模式，开启接管后可以继续发送消息。

# 可在设备管理中配置或启动实例。
source: Configure or start an instance in device management.
zh_hans: 可在设备管理中配置或启动实例。

# 可用选项已变化，请检查模型和权限后再次发送。
source: Available options have changed. Review the model and permissions, then send again.
zh_hans: 可用选项已变化，请检查模型和权限后再次发送。

# 向 Agent 发送消息
source: Sent input to agent
zh_hans: 向 Agent 发送消息

# 启用 %@
source: Activate %@
zh_hans: 激活 %@

# 命令
source: command
zh_hans: 命令

# 命令行
source: Connect using the command line
zh_hans: 使用命令行连接

# 回应失败 · 查看详情
source: Response failed · View details
zh_hans: 回应失败 · 查看详情

# 回应已提交，等待 Agent 确认
source: Response sent. Waiting for the Agent to confirm
zh_hans: 回应已提交，等待 Agent 确认

# 回应结果尚未确认。再次回应前，请确认 Agent 仍在等待此操作。
source: The response is not confirmed. Check that the Agent is still waiting for this operation before responding again.
zh_hans: 回应结果尚未确认。再次回应前，请确认 Agent 仍在等待此操作。

# 回应结果未确认，不会自动重试。
source: Response not confirmed. It will not be retried automatically.
zh_hans: 回应结果未确认，不会自动重试。

# 回车换行，Command 加回车发送。
source: Return inserts a new line. Command-Return sends the message.
zh_hans: 回车换行，Command 加回车发送。

# 图片附件
source: Image attachment
zh_hans: 图片附件

# 在 %@ 中新建会话
source: New session in %@
zh_hans: 在 %@ 中新建会话

# 在 Web 预览中打开文件
source: Open file in Web preview
zh_hans: 在 Web 预览中打开文件

# 在电脑上安装桌面应用，使用以下服务器地址登录当前账号。连接后，可以在设备管理中添加 Agent。
source: Open the desktop app, connect to the service you are using here, and sign in with the same account.
zh_hans: 打开桌面程序，连接到您当前使用的服务，并使用同一个账号登录。

# 在电脑上安装桌面应用，并登录同一账号。设备会自动显示在侧栏。
source: For the best experience on Windows or macOS, connect using the desktop app.
zh_hans: 如果您使用 Windows 或 macOS，搭配桌面程序连接可以获得最佳体验。

# 在线
source: online
zh_hans: 在线

# 在线 · 选择此设备上的 Agent
source: Online · Choose an Agent on this device
zh_hans: 在线 · 选择此设备上的 Agent

# 在设备上运行命令，将生成的六位配对码填回这里。
source: Run a command on your device, then enter the generated 6-digit pairing code here.
zh_hans: 在设备终端运行命令，将生成的 6 位配对码填回这里。

# 在这里继续你的任务
source: Continue your task here
zh_hans: 在这里继续你的任务

# 处理未确认的回应
source: Review unconfirmed response
zh_hans: 处理未确认的回应

# 复制 %@
source: Copy %@
zh_hans: 复制 %@

# 复制代码
source: Copy code
zh_hans: 复制代码

# 复制会话 ID
source: Copy Session ID
zh_hans: 复制会话 ID

# 复制内容
source: Copy text
zh_hans: 复制文本

# 复制原始 JSON
source: Copy item JSON
zh_hans: 复制 item JSON

# 复制命令
source: Copy command
zh_hans: 复制命令

# 复制回复
source: Copy reply
zh_hans: 复制回复

# 复制条目 ID
source: Copy item ID
zh_hans: 复制 item ID

# 复制路径
source: Copy Path
zh_hans: 复制路径

# 外部 Session ID
source: External ID
zh_hans: 外部 ID

# 失败
source: Failed
zh_hans: 失败

# 好
source: OK
zh_hans: 好的

# 如果使用 Windows 或 macOS，桌面程序的连接和日常使用更方便。
source: On Windows or macOS, we recommend the desktop app for easier setup and everyday use.
zh_hans: 如果您使用 Windows 或 macOS，更推荐使用桌面程序，连接和日常使用会更方便。

# 实例名称
source: Instance name
zh_hans: 实例名称

# 实时更新：%@
source: Live updates: %@
zh_hans: 实时更新：%@

# 对话选项
source: Settings
zh_hans: 设置

# 导出已加载时间线 JSON
source: Export memory JSON
zh_hans: 导出内存 JSON

# 导出服务器时间线 JSON
source: Export remote JSON
zh_hans: 导出远程 JSON

# 将使用「%@」，并将名称更新为「%@」。已有会话会保留。
source: Use “%@” and rename it to “%@”. Existing sessions will be kept.
zh_hans: 将使用「%@」，并将名称更新为「%@」。已有会话会保留。

# 尚未发现可用 Agent。在设备上安装并登录 Agent 后，重新发现即可添加。
source: No additional runtimes were discovered.
zh_hans: 没有发现其他 Runtime。

# 尚未就绪 · %@
source: Not ready · %@
zh_hans: 尚未就绪 · %@

# 尚未配置
source: Not configured
zh_hans: 尚未配置

# 展开
source: Show more
zh_hans: 展开

# 展开项目
source: Expand project
zh_hans: 展开项目

# 工作目录
source: Workspaces
zh_hans: 工作目录

# 工具
source: tool
zh_hans: 工具

# 工具调用
source: Tool calls
zh_hans: 工具调用

# 左右滑动查看其他提示
source: Swipe left or right for other notices
zh_hans: 左右滑动查看其他提示

# 已中断
source: Interrupted
zh_hans: 已中断

# 已停止生成
source: Generation stopped
zh_hans: 已停止生成

# 已到达会话开头
source: Beginning of session
zh_hans: 已到达会话开头

# 已加载条目
source: Loaded items
zh_hans: 已加载条目

# 已取消
source: Cancelled
zh_hans: 已取消

# 启动中
source: Starting
zh_hans: 启动中

# 已复制
source: Copied
zh_hans: 已复制

# 已完成
source: Completed
zh_hans: 已完成

# 已就绪
source: Ready
zh_hans: 已就绪

# 已展开
source: Expanded
zh_hans: 已展开

# 已开启
source: Enabled
zh_hans: 已启用

# 已开启，可从 Agents Anywhere 继续操作。
source: Enabled. Continue working from Agents Anywhere.
zh_hans: 已开启，可从 Agents Anywhere 继续操作。

# 已折叠
source: Collapsed
zh_hans: 已折叠

# 已检查，允许再次回应
source: Checked; allow another response
zh_hans: 已检查，允许再次回应

# 已检查，重新创建
source: Checked; create again
zh_hans: 已检查，重新创建

# 已隐藏
source: Hidden
zh_hans: 已隐藏

# 开启后可在 Agents Anywhere 中操作。记录可能需要重启 Agent 客户端才能同步；请避免同时在两个客户端操作此会话。
source: You can continue working in Agents Anywhere. Restarting the Agent client may be needed to sync messages. Avoid operating on the session from both clients at once.
zh_hans: 开启后可在 Agents Anywhere 中操作。记录可能需要重启 Agent 客户端才能同步；请避免同时在两个客户端操作此会话。

# 开启接管
source: Enable Takeover
zh_hans: 开启接管

# 开启接管？
source: Enable Takeover?
zh_hans: 开启接管？

# 开始新会话
source: Start a new session
zh_hans: 开始新会话

# 归档
source: Archive
zh_hans: 归档

# 归档会话
source: Archived sessions
zh_hans: 已归档会话

# 归档这个项目的会话？
source: Archive project
zh_hans: 归档项目

# 归档项目会话
source: Archive project
zh_hans: 归档该项目

# 当前不可用
source: Currently unavailable
zh_hans: 当前不可用

# 当前可用的 Agent 都已添加。安装其他 Agent 后，可以重新发现。
source: No more runtime types can be added on this device.
zh_hans: 这个设备暂时没有可继续添加的 Runtime 类型。

# 当前活动会话将移到归档列表，可从归档中恢复。
source: Active sessions will move to the archive. You can restore them later.
zh_hans: 当前活动会话将移到归档列表，可从归档中恢复。

# 当前目录：%@
source: Current directory: %@
zh_hans: 当前目录：%@

# 当前设置未保存，请稍后重试。
source: Failed to update model or permission.
zh_hans: 无法更新模型或权限。

# 当前运行状态不支持添加附件
source: Attachments are not supported in the current runtime state
zh_hans: 当前运行状态不支持添加附件

# 待回应交互
source: Pending interactions
zh_hans: 待回应交互

# 思考强度
source: Reasoning effort
zh_hans: 推理强度

# 思考过程
source: Reasoning
zh_hans: 推理

# 思考：%@
source: Thinking: %@
zh_hans: 思考：%@

# 恢复 Agent
source: Resumed agent
zh_hans: 恢复 Agent

# 恢复会话
source: Unarchive
zh_hans: 取消归档

# 所有盘符
source: All drives
zh_hans: 所有盘符

# 手机网络已断开
source: Your device is offline
zh_hans: 手机网络已断开

# 打开侧栏
source: Expand sidebar
zh_hans: 展开侧栏

# 打开文件预览
source: Open file preview
zh_hans: 打开文件预览

# 打开目录
source: Open directory
zh_hans: 打开目录

# 打开表单，填写后提交
source: Open the form to complete and submit
zh_hans: 打开表单，填写后提交

# 执行 %@
source: Run %@
zh_hans: 执行 %@

# 批准
source: Approve
zh_hans: 批准

# 拒绝
source: Reject
zh_hans: 拒绝

# 按目录自动填写名称，重名时添加数字后缀。也可以自行修改。
source: Generated from the directory. You can change it.
zh_hans: 根据目录自动生成，可自行修改。

# 按项目
source: By project
zh_hans: 按项目

# 接下来选择这台设备上的 Agent。选完后才会更改当前运行目标。
source: Next, choose an Agent on this device. Your current target changes only after completing both steps.
zh_hans: 接下来选择这台设备上的 Agent。选完后才会更改当前运行目标。

# 接管
source: Takeover
zh_hans: 接管

# 接管会话
source: Takeover
zh_hans: 接管

# 接管会话以继续交互
source: Take over this session to interact
zh_hans: 接管会话以继续交互
